app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("content", "image", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "je suis du texte"], ["image", "AvaToon-IdeaLabs-Homme.jpg"], ["created_at", "2020-09-12 17:07:38.068692"], ["updated_at", "2020-09-12 17:07:38.068692"], ["user_id", 16]]
---
  def create
    @blog=Blog.new(blog_params)
    @blog=current_user.blogs.build(blog_params)
    if params[:back]
      render :new
    else
      if @blog.save

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."blog_id" = $2 LIMIT $3  [["user_id", 17], ["blog_id", 4], ["LIMIT", 1]]
---
  def show
    @favorite = current_user.favorites.find_by(blog_id: @blog.id)

UPDATE "blogs" SET "image" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["image", "profil-avater.png"], ["updated_at", "2020-09-12 17:08:55.540116"], ["id", 4]]
---
  def update
    if @blog.update(blog_params)

DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 6]]
---
  def destroy
    @blog.destroy

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_blog
    @blog=Blog.find(params[:id])